app/controllers/users_controller.rb

  def index
    @user = User.all
---
SELECT `users`.* FROM `users`

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`rut`, `first_name`, `last_name`, `email`, `phone`, `facebook`, `twitter`, `created_at`, `updated_at`) VALUES ('25615332-1', 'Francisco', 'Vergara', 'test@gmail.com', '+56948436221', 'franvergara', 'sudddnel', '2017-05-22 03:10:00', '2017-05-22 03:10:00')

  def destroy
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 1